# Core cask packages
cask "arc"
cask "bitwarden"
cask "claude-code"
cask "cleanshot"
cask "clop"
cask "conductor"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "font-hack-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "httpie-desktop"
cask "iterm2"
cask "jordanbaird-ice"
cask "meetingbar"
cask "obsidian"
cask "proxyman"
cask "raycast"
cask "slack"
cask "spotify"
cask "syncthing-app"
cask "tailscale-app"
cask "temurin"
cask "zed"

# Core homebrew packages
brew "bash"
brew "bat"
brew "coreutils"
brew "cronboard"
brew "difftastic"
brew "direnv"
brew "dust"
brew "eza"
brew "fd"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "htop"
brew "icloudpd"
brew "jnv"
brew "jq"
brew "mise"
brew "mkcert"
brew "neovim"
brew "pam-reattach"
brew "pastel"
brew "ripgrep"
brew "rsync"
brew "stylua"
brew "tmux"
brew "tmuxp"
brew "viddy"
brew "vim"
brew "watch"
brew "worktrunk"
brew "yazi"
brew "zoxide"
brew "zsh"

# Custom taps
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "jesseduffield/lazynpm/lazynpm"
